In [2]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.2.2

In [20]:
my_list = [10, 20, 30, 40, 50]
series1 = pd.Series(my_list)

In [22]:
print(series1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [13]:
my_list = [10, 20, 30, 40, 50]
series2 = pd.Series(my_list, index = ['a', 'b', 'c', 'd', 'e'])

In [9]:
series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [14]:
series2['a']

10

In [18]:
series1[-1]

KeyError: -1

In [23]:
series1[1:4]

1    20
2    30
3    40
dtype: int64

In [32]:
series2[1: 4: 2]

b    20
d    40
dtype: int64

In [33]:
# DataFrames
students = {'Roll_no': [101, 102, 103, 104, 105],
           'Name': ['Ali', 'Ahmad', 'Umer', 'Zubair', 'Tayyab'],
           'Subject': ['OOP', 'Database', 'Software Engineering', 'OS', 'Programing'],
           'Marks': [80, 87, 67, 56, 92]}

In [34]:
df = pd.DataFrame(students)

In [35]:
df

   Roll_no    Name               Subject  Marks
0      101     Ali                   OOP     80
1      102   Ahmad              Database     87
2      103    Umer  Software Engineering     67
3      104  Zubair                    OS     56
4      105  Tayyab            Programing     92

In [36]:
df['Name']

0       Ali
1     Ahmad
2      Umer
3    Zubair
4    Tayyab
Name: Name, dtype: object

In [39]:
df[['Name', 'Subject', 'Marks']]

     Name               Subject  Marks
0     Ali                   OOP     80
1   Ahmad              Database     87
2    Umer  Software Engineering     67
3  Zubair                    OS     56
4  Tayyab            Programing     92

In [40]:
df

   Roll_no    Name               Subject  Marks
0      101     Ali                   OOP     80
1      102   Ahmad              Database     87
2      103    Umer  Software Engineering     67
3      104  Zubair                    OS     56
4      105  Tayyab            Programing     92

In [41]:
df['Percentage'] = df['Marks']/200 * 100

In [42]:
df

   Roll_no    Name               Subject  Marks  Percentage
0      101     Ali                   OOP     80        40.0
1      102   Ahmad              Database     87        43.5
2      103    Umer  Software Engineering     67        33.5
3      104  Zubair                    OS     56        28.0
4      105  Tayyab            Programing     92        46.0

In [43]:
df.loc[1:3]

   Roll_no    Name               Subject  Marks  Percentage
1      102   Ahmad              Database     87        43.5
2      103    Umer  Software Engineering     67        33.5
3      104  Zubair                    OS     56        28.0

In [44]:
df.loc[1:3, ['Name', 'Subject', 'Marks']]

     Name               Subject  Marks
1   Ahmad              Database     87
2    Umer  Software Engineering     67
3  Zubair                    OS     56

In [49]:
df.loc[:, ['Name']]

     Name
0     Ali
1   Ahmad
2    Umer
3  Zubair
4  Tayyab

In [50]:
df

   Roll_no    Name               Subject  Marks  Percentage
0      101     Ali                   OOP     80        40.0
1      102   Ahmad              Database     87        43.5
2      103    Umer  Software Engineering     67        33.5
3      104  Zubair                    OS     56        28.0
4      105  Tayyab            Programing     92        46.0

In [55]:
df.iloc[1:3, [1, 4]]

    Name  Percentage
1  Ahmad        43.5
2   Umer        33.5

In [56]:
df

   Roll_no    Name               Subject  Marks  Percentage
0      101     Ali                   OOP     80        40.0
1      102   Ahmad              Database     87        43.5
2      103    Umer  Software Engineering     67        33.5
3      104  Zubair                    OS     56        28.0
4      105  Tayyab            Programing     92        46.0

In [57]:
df2 = df.set_index('Roll_no')

In [58]:
df2

           Name               Subject  Marks  Percentage
Roll_no
101         Ali                   OOP     80        40.0
102       Ahmad              Database     87        43.5
103        Umer  Software Engineering     67        33.5
104      Zubair                    OS     56        28.0
105      Tayyab            Programing     92        46.0

In [62]:
df2.loc[[103,105]]

           Name               Subject  Marks  Percentage
Roll_no
103        Umer  Software Engineering     67        33.5
105      Tayyab            Programing     92        46.0